In [9]:
import pandas as pd

#Sales1
d = {2014:[100.5,150.8,200.9,30000],
     2015:[12000,18000,22000,30000],
     2016:[20000,50000,70000,100000]}
Sales1=pd.DataFrame(d,index=['Madhu',"Kusum","Kinshuk","Ankit"])

#Sales 2
dict1={2018:[160000,110000,500000,340000]}
Sales2=pd.DataFrame(dict1,index=["Madhu","Kusum","Kinshuk","Ankit"])

#Appending Dataframes
Sales = pd.concat([Sales1, Sales2], axis=1)
print(Sales)

            2014   2015    2016    2018
Madhu      100.5  12000   20000  160000
Kusum      150.8  18000   50000  110000
Kinshuk    200.9  22000   70000  500000
Ankit    30000.0  30000  100000  340000

In [23]:
import pandas as pd

d = {2014:[100.5,150.8,200.9,30000,4000],
     2015:[12000,18000,22000,30000,45000],
     2016:[20000,50000,70000,10000,125000],
     2017:[50000,60000,70000,80000,90000]}
Sales=pd.DataFrame(d,index=['Madhu',"Kusum","Kinshuk","Ankit","Shruti"])

print(Sales.T)

        Madhu    Kusum  Kinshuk    Ankit    Shruti
2014    100.5    150.8    200.9  30000.0    4000.0
2015  12000.0  18000.0  22000.0  30000.0   45000.0
2016  20000.0  50000.0  70000.0  10000.0  125000.0
2017  50000.0  60000.0  70000.0  80000.0   90000.0

In [27]:
print(Sales[2017])

Madhu      50000
Kusum      60000
Kinshuk    70000
Ankit      80000
Shruti     90000
Name: 2017, dtype: int64

In [28]:
Sales[2018]=[160000,110000,500000,340000,900000]

print(Sales.loc[['Madhu','Ankit'], [2017,2018]])

        2017    2018
Madhu  50000  160000
Ankit  80000  340000

In [29]:
print(Sales.loc[Sales.index=='Shruti',2016])

Shruti    125000
Name: 2016, dtype: int64

In [30]:
Sales.loc["Sumeet"]=[196.2,37800,52000,78438,38852]
print(Sales)

            2014     2015      2016     2017      2018
Madhu      100.5  12000.0   20000.0  50000.0  160000.0
Kusum      150.8  18000.0   50000.0  60000.0  110000.0
Kinshuk    200.9  22000.0   70000.0  70000.0  500000.0
Ankit    30000.0  30000.0   10000.0  80000.0  340000.0
Shruti    4000.0  45000.0  125000.0  90000.0  900000.0
Sumeet     196.2  37800.0   52000.0  78438.0   38852.0

In [31]:
Sales.drop(columns=2014)

            2015      2016     2017      2018
Madhu    12000.0   20000.0  50000.0  160000.0
Kusum    18000.0   50000.0  60000.0  110000.0
Kinshuk  22000.0   70000.0  70000.0  500000.0
Ankit    30000.0   10000.0  80000.0  340000.0
Shruti   45000.0  125000.0  90000.0  900000.0
Sumeet   37800.0   52000.0  78438.0   38852.0

In [32]:
Sales.drop("Kinshuk",axis=0)
Sales.drop("Kinshuk")

           2014     2015      2016     2017      2018
Madhu     100.5  12000.0   20000.0  50000.0  160000.0
Kusum     150.8  18000.0   50000.0  60000.0  110000.0
Ankit   30000.0  30000.0   10000.0  80000.0  340000.0
Shruti   4000.0  45000.0  125000.0  90000.0  900000.0
Sumeet    196.2  37800.0   52000.0  78438.0   38852.0

In [33]:
Sales=Sales.rename({"Ankit":"Vivaan","Madhu":"Shailesh"},axis="index")
print(Sales)

             2014     2015      2016     2017      2018
Shailesh    100.5  12000.0   20000.0  50000.0  160000.0
Kusum       150.8  18000.0   50000.0  60000.0  110000.0
Kinshuk     200.9  22000.0   70000.0  70000.0  500000.0
Vivaan    30000.0  30000.0   10000.0  80000.0  340000.0
Shruti     4000.0  45000.0  125000.0  90000.0  900000.0
Sumeet      196.2  37800.0   52000.0  78438.0   38852.0

In [34]:
Sales.loc[Sales.index=="Shailesh",2018]=100000
print(Sales)

             2014     2015      2016     2017      2018
Shailesh    100.5  12000.0   20000.0  50000.0  100000.0
Kusum       150.8  18000.0   50000.0  60000.0  110000.0
Kinshuk     200.9  22000.0   70000.0  70000.0  500000.0
Vivaan    30000.0  30000.0   10000.0  80000.0  340000.0
Shruti     4000.0  45000.0  125000.0  90000.0  900000.0
Sumeet      196.2  37800.0   52000.0  78438.0   38852.0

In [35]:
Sales.to_csv("salesFigures.csv",index=False,header=False)

In [36]:
salesretrieved=pd.read_csv("salesFigures.csv",names=['2015','2016','2017','2018'])
print(salesretrieved)

            2015      2016     2017      2018
100.5    12000.0   20000.0  50000.0  100000.0
150.8    18000.0   50000.0  60000.0  110000.0
200.9    22000.0   70000.0  70000.0  500000.0
30000.0  30000.0   10000.0  80000.0  340000.0
4000.0   45000.0  125000.0  90000.0  900000.0
196.2    37800.0   52000.0  78438.0   38852.0

In [37]:
salesretrieved.index=["Madhu", "Kusum", "Kinshuk", "Ankit", "Shruti","Sumeet"]
print(salesretrieved)

            2015      2016     2017      2018
Madhu    12000.0   20000.0  50000.0  100000.0
Kusum    18000.0   50000.0  60000.0  110000.0
Kinshuk  22000.0   70000.0  70000.0  500000.0
Ankit    30000.0   10000.0  80000.0  340000.0
Shruti   45000.0  125000.0  90000.0  900000.0
Sumeet   37800.0   52000.0  78438.0   38852.0